import { Component, Fragment } from 'react';
import './../../assets/styles/signin.css'

class GetNotification extends Component {
  constructor(props) {
    super(props);
    this.state = { username: '', password: '' };
  }

  inputChangeHandler = (event) => {
    this.setState({ [event.target.name]: event.target.value })
  }

  check = () => {
    console.log(`user:${this.state.username},pass:${this.state.password}`)
  }


  render() {
    return (
      <Fragment>
        <div id="get_notification">
          <h1>اعلانات</h1>
          <div className="box">
            <p className="title">محتوا متنی چیست؟</p>
            <p className="body">منظور از محتوا متنی تمام اطلاعات ، از جمله کلمات و عبارت­ها ، جملات و پارگراف­ها و … است. ما از طریق این اطلاعات معنی و منظور را به خواننده منتقل می­کنیم و به همین ترتیب ارتباط بین نویسنده و خواننده شکل می­گیرد.

محتوا متنی از اهمیت بالایی برخوردار است ، به این دلیل که اولا در متن به طور کامل جزئیات توضیح داده می­شود و دوما از این نظر که بهینه­‌سازی  و استاندارد بودن مطالب محتوا شما در صورت آنلاین و دیجیتال بودن در گوگل بررسی می­شود.</p>
            <p className="date">1399/10/10</p>
          </div>
          <div className="box">
            <p className="title">محتوا متنی چیست؟</p>
            <p className="body">منظور از محتوا متنی تمام اطلاعات ، از جمله کلمات و عبارت­ها ، جملات و پارگراف­ها و … است. ما از طریق این اطلاعات معنی و منظور را به خواننده منتقل می­کنیم و به همین ترتیب ارتباط بین نویسنده و خواننده شکل می­گیرد.

محتوا متنی از اهمیت بالایی برخوردار است ، به این دلیل که اولا در متن به طور کامل جزئیات توضیح داده می­شود و دوما از این نظر که بهینه­‌سازی  و استاندارد بودن مطالب محتوا شما در صورت آنلاین و دیجیتال بودن در گوگل بررسی می­شود.</p>
            <p className="date">1399/10/10</p>
          </div>
          <div className="box">
            <p className="title">محتوا متنی چیست؟</p>
            <p className="body">منظور از محتوا متنی تمام اطلاعات ، از جمله کلمات و عبارت­ها ، جملات و پارگراف­ها و … است. ما از طریق این اطلاعات معنی و منظور را به خواننده منتقل می­کنیم و به همین ترتیب ارتباط بین نویسنده و خواننده شکل می­گیرد.

محتوا متنی از اهمیت بالایی برخوردار است ، به این دلیل که اولا در متن به طور کامل جزئیات توضیح داده می­شود و دوما از این نظر که بهینه­‌سازی  و استاندارد بودن مطالب محتوا شما در صورت آنلاین و دیجیتال بودن در گوگل بررسی می­شود.</p>
            <p className="date">1399/10/10</p>
          </div>
          <div className="box">
            <p className="title">محتوا متنی چیست؟</p>
            <p className="body">منظور از محتوا متنی تمام اطلاعات ، از جمله کلمات و عبارت­ها ، جملات و پارگراف­ها و … است. ما از طریق این اطلاعات معنی و منظور را به خواننده منتقل می­کنیم و به همین ترتیب ارتباط بین نویسنده و خواننده شکل می­گیرد.

محتوا متنی از اهمیت بالایی برخوردار است ، به این دلیل که اولا در متن به طور کامل جزئیات توضیح داده می­شود و دوما از این نظر که بهینه­‌سازی  و استاندارد بودن مطالب محتوا شما در صورت آنلاین و دیجیتال بودن در گوگل بررسی می­شود.</p>
            <p className="date">1399/10/10</p>
          </div>
          <div className="box">
            <p className="title">محتوا متنی چیست؟</p>
            <p className="body">منظور از محتوا متنی تمام اطلاعات ، از جمله کلمات و عبارت­ها ، جملات و پارگراف­ها و … است. ما از طریق این اطلاعات معنی و منظور را به خواننده منتقل می­کنیم و به همین ترتیب ارتباط بین نویسنده و خواننده شکل می­گیرد.

محتوا متنی از اهمیت بالایی برخوردار است ، به این دلیل که اولا در متن به طور کامل جزئیات توضیح داده می­شود و دوما از این نظر که بهینه­‌سازی  و استاندارد بودن مطالب محتوا شما در صورت آنلاین و دیجیتال بودن در گوگل بررسی می­شود.</p>
            <p className="date">1399/10/10</p>
          </div>
          <div className="box">
            <p className="title">محتوا متنی چیست؟</p>
            <p className="body">منظور از محتوا متنی تمام اطلاعات ، از جمله کلمات و عبارت­ها ، جملات و پارگراف­ها و … است. ما از طریق این اطلاعات معنی و منظور را به خواننده منتقل می­کنیم و به همین ترتیب ارتباط بین نویسنده و خواننده شکل می­گیرد.

محتوا متنی از اهمیت بالایی برخوردار است ، به این دلیل که اولا در متن به طور کامل جزئیات توضیح داده می­شود و دوما از این نظر که بهینه­‌سازی  و استاندارد بودن مطالب محتوا شما در صورت آنلاین و دیجیتال بودن در گوگل بررسی می­شود.</p>
            <p className="date">1399/10/10</p>
          </div>
          <div className="box">
            <p className="title">محتوا متنی چیست؟</p>
            <p className="body">منظور از محتوا متنی تمام اطلاعات ، از جمله کلمات و عبارت­ها ، جملات و پارگراف­ها و … است. ما از طریق این اطلاعات معنی و منظور را به خواننده منتقل می­کنیم و به همین ترتیب ارتباط بین نویسنده و خواننده شکل می­گیرد.

محتوا متنی از اهمیت بالایی برخوردار است ، به این دلیل که اولا در متن به طور کامل جزئیات توضیح داده می­شود و دوما از این نظر که بهینه­‌سازی  و استاندارد بودن مطالب محتوا شما در صورت آنلاین و دیجیتال بودن در گوگل بررسی می­شود.</p>
            <p className="date">1399/10/10</p>
          </div>
          <div className="box">
            <p className="title">محتوا متنی چیست؟</p>
            <p className="body">منظور از محتوا متنی تمام اطلاعات ، از جمله کلمات و عبارت­ها ، جملات و پارگراف­ها و … است. ما از طریق این اطلاعات معنی و منظور را به خواننده منتقل می­کنیم و به همین ترتیب ارتباط بین نویسنده و خواننده شکل می­گیرد.

محتوا متنی از اهمیت بالایی برخوردار است ، به این دلیل که اولا در متن به طور کامل جزئیات توضیح داده می­شود و دوما از این نظر که بهینه­‌سازی  و استاندارد بودن مطالب محتوا شما در صورت آنلاین و دیجیتال بودن در گوگل بررسی می­شود.</p>
            <p className="date">1399/10/10</p>
          </div>
          <div className="box">
            <p className="title">محتوا متنی چیست؟</p>
            <p className="body">منظور از محتوا متنی تمام اطلاعات ، از جمله کلمات و عبارت­ها ، جملات و پارگراف­ها و … است. ما از طریق این اطلاعات معنی و منظور را به خواننده منتقل می­کنیم و به همین ترتیب ارتباط بین نویسنده و خواننده شکل می­گیرد.

محتوا متنی از اهمیت بالایی برخوردار است ، به این دلیل که اولا در متن به طور کامل جزئیات توضیح داده می­شود و دوما از این نظر که بهینه­‌سازی  و استاندارد بودن مطالب محتوا شما در صورت آنلاین و دیجیتال بودن در گوگل بررسی می­شود.</p>
            <p className="date">1399/10/10</p>
          </div>
          <div className="box">
            <p className="title">محتوا متنی چیست؟</p>
            <p className="body">منظور از محتوا متنی تمام اطلاعات ، از جمله کلمات و عبارت­ها ، جملات و پارگراف­ها و … است. ما از طریق این اطلاعات معنی و منظور را به خواننده منتقل می­کنیم و به همین ترتیب ارتباط بین نویسنده و خواننده شکل می­گیرد.

محتوا متنی از اهمیت بالایی برخوردار است ، به این دلیل که اولا در متن به طور کامل جزئیات توضیح داده می­شود و دوما از این نظر که بهینه­‌سازی  و استاندارد بودن مطالب محتوا شما در صورت آنلاین و دیجیتال بودن در گوگل بررسی می­شود.</p>
            <p className="date">1399/10/10</p>
          </div>
        </div>
      </Fragment>
    );
  }
}

export default GetNotification;
